package day03_operator;

public class Ex01_Op {

	public static void main(String[] args) {
		/*
		 * 자주 사용하는거니 꼭 알아두자!!
		 : (나누기) 정수 / 정수 = 정수(몫)
				 실수 / 정수 = 실수
			
			%(mod)연산자 : 정수 % 정수 = 나머지 /나머지 연산자라고도 한다
			예)
			10 / 3 = 3
			10 % 3 = 1 
		    10 / 3.0 = 3.33333 하나라도 실수값이 있으면 실수로 나온다
		    
		    % 연산자를 이용하여 어떤 수의 배수, 또는 짜,홀을 구분
		    10(N) % 2 = 0 : 짝수           (N : 어떤숫자)
		    10(N) % 2 = 1 : 홀수   
		    
		    12(N) % 2 = 0 : 짝수이면서 2의 배수
		    12(N) % 3 = 0 : 3의 배수
		 */
		
		
	}
}
